qouteBoard/app/controllers/qoutations_controller.rb

  def index
    @qoutations = Qoutation.all
---
SELECT "qoutations".* FROM "qoutations"

  def create
    @qoutation = Qoutation.new(qoutation_params)
    @qoutation.user = current_user
    respond_to do |format|
      if @qoutation.save
---
INSERT INTO "qoutations" ("quote", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["quote", "hello"], ["created_at", "2021-09-10 05:33:55.587363"], ["updated_at", "2021-09-10 05:33:55.587363"], ["user_id", 3]]

  def destroy
    @qoutation.destroy
---
DELETE FROM "qoutations" WHERE "qoutations"."id" = $1  [["id", 1]]

  def set_qoutation
    @qoutation = Qoutation.find(params[:id])
---
SELECT "qoutations".* FROM "qoutations" WHERE "qoutations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]