qouteBoard/app/models/user.rb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Member"], ["LIMIT", 1]]
---
  def assign_role
    self.role = Role.find_by_name('Member') if role.nil?